         Dcl-Pr DayOfWeek ZONED(1) ;
           WorkDate  Date;
         End-Pr;

         Dcl-Pr DayName Char(9);
           WorkDate Date;
         End-Pr;

         Dcl-Pr DateWords Char(28);
           WorkDate  Date;
         End-Pr;            
